In [1]:
import pandas as pd
import numpy as np

In [2]:
score_df = pd.DataFrame([[1,50,80,70], 
              [2,60,45,50],
              [3,98,43,55],
              [4,70,69,89],
              [5,56,79,60],
              [6,60,68,55],
              [7,45,70,77],
              [8,55,77,76],
              [9,25,57,60],
              [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])
score_df = score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score
student_id
1                   50             80             70
2                   60             45             50
3                   98             43             55
4                   70             69             89
5                   56             79             60
6                   60             68             55
7                   45             70             77
8                   55             77             76
9                   25             57             60
10                  88             40             43

In [3]:
score_df.mean()

math_score       60.7
english_score    62.8
chinese_score    63.5
dtype: float64

In [5]:
score_df.math_score.mean()

60.7

In [6]:
score_df.mean(axis=1)

student_id
1     66.666667
2     51.666667
3     65.333333
4     76.000000
5     65.000000
6     61.000000
7     64.000000
8     69.333333
9     47.333333
10    57.000000
dtype: float64

In [7]:
score_df.sum(axis=1)

student_id
1     200
2     155
3     196
4     228
5     195
6     183
7     192
8     208
9     142
10    171
dtype: int64

In [8]:
score_df.count()

math_score       10
english_score    10
chinese_score    10
dtype: int64

In [9]:
score_df.median()

math_score       58.0
english_score    68.5
chinese_score    60.0
dtype: float64

In [10]:
score_df.quantile(0.75)

math_score       67.50
english_score    75.25
chinese_score    74.50
Name: 0.75, dtype: float64

In [11]:
score_df.max()

math_score       98
english_score    80
chinese_score    89
dtype: int64

In [12]:
score_df.min()

math_score       25
english_score    40
chinese_score    43
dtype: int64

In [13]:
score_df.std()

math_score       20.854256
english_score    15.418603
chinese_score    14.151953
dtype: float64

In [14]:
score_df.corr()

               math_score  english_score  chinese_score
math_score       1.000000      -0.532708      -0.314552
english_score   -0.532708       1.000000       0.682340
chinese_score   -0.314552       0.682340       1.000000

In [15]:
score_df.apply(lambda x : x**(0.5)*10)

            math_score  english_score  chinese_score
student_id
1            70.710678      89.442719      83.666003
2            77.459667      67.082039      70.710678
3            98.994949      65.574385      74.161985
4            83.666003      83.066239      94.339811
5            74.833148      88.881944      77.459667
6            77.459667      82.462113      74.161985
7            67.082039      83.666003      87.749644
8            74.161985      87.749644      87.177979
9            50.000000      75.498344      77.459667
10           93.808315      63.245553      65.574385

In [16]:
score_df.apply(sum,axis=1)

student_id
1     200
2     155
3     196
4     228
5     195
6     183
7     192
8     208
9     142
10    171
dtype: int64

In [17]:
score_df.sum(axis=1)

student_id
1     200
2     155
3     196
4     228
5     195
6     183
7     192
8     208
9     142
10    171
dtype: int64